Revit 2027 API
BuiltInFailures.KeynoteTagFailures Class
 Failures related to keynote tags.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.KeynoteTagFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class KeynoteTagFailures
Public NotInheritable Class KeynoteTagFailures
public ref class KeynoteTagFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type KeynoteTagFailures = class end
The BuiltInFailures.KeynoteTagFailures type exposes the following members.
Properties
Name | Description
KeynoteOnLinkWithDifferentKeynoteFile |  The parameters of the keynote tag are empty because the keynoted linked element uses a different keynote file.
NoKeynoteAssignedToLinkedElement |  The parameters of the keynote tag are empty because the keynoted linked element uses a different keynote file.
Top
See Also
Reference
Autodesk.Revit.DB Namespace